# 1. Базовый образ
FROM python:3.12.8-slim

# 2. Установка рабочей директории внутри контейнера
WORKDIR /app

# 3. Копирование файла с зависимостями
#    Убедитесь, что файл requirements.txt сохранен в кодировке UTF-8
COPY requirements.txt .

# 4. Установка зависимостей
RUN pip install --no-cache-dir -r requirements.txt

# 5. Копирование всего кода приложения в рабочую директорию
COPY . .

# 6. Открытие порта, на котором будет работать приложение
EXPOSE 8000

# 7. Команда для запуска приложения
CMD ["uvicorn", "main:app", "--host", "0.0.0.0", "--port", "8000"]
